Autodesk.Revit.DB.Events.ExtendedApiToConfigureEventArgs.GetRaisingApplication
Since:
2025

Autodesk.Revit.DB.Events.ExtendedApiToConfigureEventArgs.Services
Gets the IServiceCollection that is used for configuring extended APIs servcies.
Since:
2025

Autodesk.Revit.DB.Events.ExtendedApiToConfigureEventArgs
An event that allows extended API providers to register the APIs.
Since:
2025